#### Terraform Plan ('src/domains/cgn/prod') 📖
<details>
<summary>Terraform Plan</summary>

```hcl
ion_string    = (sensitive value) -> null
      - primary_blob_host                 = "iopcgnfnsdt.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_web_host                  = "iopcgnfnsdt.z6.web.core.windows.net" -> null
      - resource_group_name               = "io-p-cgn-be-rg" -> null
        tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (36 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.functions.module.function_cgn_merchant.module.storage_account.azurerm_storage_account.this has been deleted
  - resource "azurerm_storage_account" "this" {
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnmerchantfnst" -> null
      - name                              = "iopcgnmerchantfnst" -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_host                 = "iopcgnmerchantfnst.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_web_host                  = "iopcgnmerchantfnst.z6.web.core.windows.net" -> null
      - resource_group_name               = "io-p-cgn-be-rg" -> null
        tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (36 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.apim.azurerm_api_management_named_value.cgnonboardingportal_os_url_value_v2 will be updated in-place
  ~ resource "azurerm_api_management_named_value" "cgnonboardingportal_os_url_value_v2" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/namedValues/cgnonboardingportal-os-url"
        name                = "cgnonboardingportal-os-url"
        tags                = []
      ~ value               = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_named_value.io_fn_cgnmerchant_url_v2 will be updated in-place
  ~ resource "azurerm_api_management_named_value" "io_fn_cgnmerchant_url_v2" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/namedValues/io-fn-cgnmerchant-url"
        name                = "io-fn-cgnmerchant-url"
        tags                = []
      ~ value               = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_itn.azurerm_api_management_named_value.cgnonboardingportal_os_url_value_v2 will be updated in-place
  ~ resource "azurerm_api_management_named_value" "cgnonboardingportal_os_url_value_v2" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/namedValues/cgnonboardingportal-os-url"
        name                = "cgnonboardingportal-os-url"
        tags                = []
      ~ value               = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.apim_itn.azurerm_api_management_named_value.io_fn_cgnmerchant_url_v2 will be updated in-place
  ~ resource "azurerm_api_management_named_value" "io_fn_cgnmerchant_url_v2" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/namedValues/io-fn-cgnmerchant-url"
        name                = "io-fn-cgnmerchant-url"
        tags                = []
      ~ value               = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.cosmos.azurerm_monitor_metric_alert.cosmos_cgn_throttling_alert will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "cosmos_cgn_throttling_alert" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Insights/metricAlerts/[CGN | io-p-cosmos-cgn] Throttling"
        name                     = "[CGN | io-p-cosmos-cgn] Throttling"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_private_endpoint.cosno_remote_content_itn must be replaced
-/+ resource "azurerm_private_endpoint" "cosno_remote_content_itn" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-cosno-pep-01" -> (known after apply)
        name                          = "io-p-itn-cgn-cosno-pep-01"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/networkInterfaces/io-p-itn-cgn-cosno-pep-01.nic.36499b7f-1fac-438b-9bf6-9253b0b83a73"
              - name = "io-p-itn-cgn-cosno-pep-01.nic.36499b7f-1fac-438b-9bf6-9253b0b83a73"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-cosno-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.documents.azure.com"
              - name                = "privatelink.documents.azure.com"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-cosmos-cgn.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.20.2.111",
                        ]
                      - name         = "io-p-cosmos-cgn"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-cosmos-cgn-italynorth.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.20.2.113",
                        ]
                      - name         = "io-p-cosmos-cgn-italynorth"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-cosmos-cgn-spaincentral.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.20.2.137",
                        ]
                      - name         = "io-p-cosmos-cgn-spaincentral"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-cosno-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "io-p-itn-cgn-cosno-pep-01"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.20.2.111" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.functions.azurerm_app_service_plan.app_service_plan_cgn_common will be created
  + resource "azurerm_app_service_plan" "app_service_plan_cgn_common" {
      + id                           = (known after apply)
      + kind                         = "Linux"
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "io-p-plan-cgn-common"
      + reserved                     = true
      + resource_group_name          = "io-p-cgn-be-rg"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + sku {
          + capacity = 1
          + size     = "P1v3"
          + tier     = "PremiumV3"
        }
    }

  # module.cosmos.module.cosmos_account_cgn.azurerm_cosmosdb_account.this must be replaced
-/+ resource "azurerm_cosmosdb_account" "this" {
      ~ connection_strings                           = (sensitive value)
      ~ create_mode                                  = "Default" -> (known after apply)
      ~ endpoint                                     = "https://io-p-cosmos-cgn.documents.azure.com:443/" -> (known after apply)
      ~ id                                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn" -> (known after apply)
      ~ location                                     = "westeurope" -> "italynorth" # forces replacement
      + mongo_server_version                         = (known after apply)
        name                                         = "io-p-cosmos-cgn"
      - network_acl_bypass_ids                       = [] -> null
      ~ primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      ~ primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      ~ primary_readonly_sql_connection_string       = (sensitive value)
      ~ primary_sql_connection_string                = (sensitive value)
      ~ read_endpoints                               = [
          - "https://io-p-cosmos-cgn-italynorth.documents.azure.com:443/",
          - "https://io-p-cosmos-cgn-spaincentral.documents.azure.com:443/",
        ] -> (known after apply)
      ~ secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      ~ secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      ~ secondary_readonly_sql_connection_string     = (sensitive value)
      ~ secondary_sql_connection_string              = (sensitive value)
        tags                                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
      ~ write_endpoints                              = [
          - "https://io-p-cosmos-cgn-italynorth.documents.azure.com:443/",
        ] -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ analytical_storage (known after apply)
      - analytical_storage {
            # (1 unchanged attribute hidden)
        }

      ~ backup {
          ~ interval_in_minutes = 0 -> (known after apply)
          ~ retention_in_hours  = 0 -> (known after apply)
          + storage_redundancy  = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ capabilities (known after apply)

      ~ capacity (known after apply)

      ~ consistency_policy {
          - max_interval_in_seconds = 5 -> null
          - max_staleness_prefix    = 100 -> null
            # (1 unchanged attribute hidden)
        }

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "io-p-cosmos-cgn-italynorth" -> null
          - location          = "italynorth" -> null
          - zone_redundant    = true -> null
        }
      - geo_location {
          - failover_priority = 1 -> null
          - id                = "io-p-cosmos-cgn-spaincentral" -> null
          - location          = "spaincentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "spaincentral"
          + zone_redundant    = false
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "7bc4b2e1-76c1-4fe4-b092-ecc1ef2299ad" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.cosmos.module.cosmos_account_cgn.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Insights/metricAlerts/[CGN | io-p-cosmos-cgn] Provisioned Throughput Exceeded"
        name                     = "[CGN | io-p-cosmos-cgn] Provisioned Throughput Exceeded"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

      ~ criteria {
            # (6 unchanged attributes hidden)

          ~ dimension {
                name     = "Region"
              ~ values   = [
                  ~ "westeurope" -> "italynorth",
                ]
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.functions.module.function_cgn.azurerm_private_endpoint.blob[0] must be replaced
-/+ resource "azurerm_private_endpoint" "blob" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-blob-endpoint" -> (known after apply)
        name                          = "iopcgnfnsdt-blob-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/networkInterfaces/iopcgnfnsdt-blob-endpoint.nic.195f2d01-019f-4397-bcc9-30ee94b0d527"
              - name = "iopcgnfnsdt-blob-endpoint.nic.195f2d01-019f-4397-bcc9-30ee94b0d527"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-blob-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-blob-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "iopcgnfnsdt-blob"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnsdt" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.240.77" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.functions.module.function_cgn.azurerm_private_endpoint.queue[0] must be replaced
-/+ resource "azurerm_private_endpoint" "queue" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-queue-endpoint" -> (known after apply)
        name                          = "iopcgnfnsdt-queue-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/networkInterfaces/iopcgnfnsdt-queue-endpoint.nic.68d4c482-47d3-4080-9ef8-a2fa777a659d"
              - name = "iopcgnfnsdt-queue-endpoint.nic.68d4c482-47d3-4080-9ef8-a2fa777a659d"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-queue-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-queue-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "iopcgnfnsdt-queue"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnsdt" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.240.78" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.functions.module.function_cgn.azurerm_private_endpoint.table[0] must be replaced
-/+ resource "azurerm_private_endpoint" "table" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-table-endpoint" -> (known after apply)
        name                          = "iopcgnfnsdt-table-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/networkInterfaces/iopcgnfnsdt-table-endpoint.nic.2253a81d-9928-4cad-85f1-35742f187ee6"
              - name = "iopcgnfnsdt-table-endpoint.nic.2253a81d-9928-4cad-85f1-35742f187ee6"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-table-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.table.core.windows.net"
              - name                = "privatelink.table.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-table-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "iopcgnfnsdt-table"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnsdt" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.240.76" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.redis.module.redis_cgn.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-redis-cgn-std-private-endpoint" -> (known after apply)
        name                          = "io-p-redis-cgn-std-private-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/networkInterfaces/io-p-redis-cgn-std-private-endpoint.nic.18e255e9-af62-4507-9810-3835521c37ce"
              - name = "io-p-redis-cgn-std-private-endpoint.nic.18e255e9-af62-4507-9810-3835521c37ce"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-redis-cgn-std-private-endpoint/privateDnsZoneGroups/io-p-redis-cgn-std-private-dns-zone-group/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-redis-cgn-std-private-endpoint/privateDnsZoneGroups/io-p-redis-cgn-std-private-dns-zone-group" -> (known after apply)
            name                 = "io-p-redis-cgn-std-private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "io-p-redis-cgn-std-private-service-connection"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Cache/redis/io-p-redis-cgn-std" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.14.4" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.redis.module.redis_cgn.azurerm_redis_cache.this will be created
  + resource "azurerm_redis_cache" "this" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + minimum_tls_version           = "1.2"
      + name                          = "io-p-redis-cgn-std"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "io-p-rg-cgn"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Monday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Tuesday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Wednesday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Thursday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
          + rdb_backup_enabled              = false
        }
    }

  # module.storage_accounts.module.storage_account_cosmos_backup.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Storage/storageAccounts/iopstcosmosbonusbackup"
        name                              = "iopstcosmosbonusbackup"
      ~ public_network_access_enabled     = true -> false
        tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (41 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.functions.module.function_cgn.module.storage_account.azurerm_advanced_threat_protection.this will be created
  + resource "azurerm_advanced_threat_protection" "this" {
      + enabled            = true
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # module.functions.module.function_cgn.module.storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Insights/metricAlerts/[iopcgnfnst] Low Availability"
        name                     = "[iopcgnfnst] Low Availability"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnst",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_cgn.module.storage_account.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopcgnfnst"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-cgn-be-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.functions.module.function_cgn.module.storage_account_durable_function[0].azurerm_advanced_threat_protection.this will be created
  + resource "azurerm_advanced_threat_protection" "this" {
      + enabled            = false
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # module.functions.module.function_cgn.module.storage_account_durable_function[0].azurerm_monitor_metric_alert.storage_account_low_availability[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Insights/metricAlerts/[iopcgnfnsdt] Low Availability"
        name                     = "[iopcgnfnsdt] Low Availability"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnsdt",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_cgn.module.storage_account_durable_function[0].azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopcgnfnsdt"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-cgn-be-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.functions.module.function_cgn_merchant.module.storage_account.azurerm_advanced_threat_protection.this will be created
  + resource "azurerm_advanced_threat_protection" "this" {
      + enabled            = true
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # module.functions.module.function_cgn_merchant.module.storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Insights/metricAlerts/[iopcgnmerchantfnst] Low Availability"
        name                     = "[iopcgnmerchantfnst] Low Availability"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnmerchantfnst",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_cgn_merchant.module.storage_account.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopcgnmerchantfnst"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-cgn-be-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

Plan: 14 to add, 10 to change, 6 to destroy.

Changes to Outputs:
  ~ cosmos_cgn                   = {
      ~ id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn" -> (known after apply)
        name = "io-p-cosmos-cgn"
    }
  ~ redis                        = {
      ~ id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Cache/redis/io-p-redis-cgn-std" -> (known after apply)
        name = "io-p-redis-cgn-std"
    }

Warning: Deprecated Resource

  with module.functions.azurerm_app_service_plan.app_service_plan_cgn_common,
  on ../_modules/functions_apps/app_service_plan_cgn_common.tf line 1, in resource "azurerm_app_service_plan" "app_service_plan_cgn_common":
   1: resource "azurerm_app_service_plan" "app_service_plan_cgn_common" {

The `azurerm_app_service_plan` resource has been superseded by the
`azurerm_service_plan` resource. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and one more similar warning elsewhere)
::error::Terraform exited with code 1.

```

</details>
